WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetAnyUri_Client_Request-6.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetAnyUri</a:Action>
    <a:MessageID>urn:uuid:92feff7b-16fc-4c4d-be33-c2d1734f634c</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetAnyUri xmlns="http://tempuri.org/">
      <inUri xmlns="">http://66.102.7.104/search?q=cache:nAKRq2xF-YMJ:deutschlandsuchtensuperstar.rtl.de/+dsds&amp;hl=en</inUri>
    </RetAnyUri>
  </s:Body>
</s:Envelope>